In [1]:
import numpy as np 
import pandas as pd

**CREATING A DATAFRAME**

In [5]:
data = {
    "Name" : ['john','anna','peter','linda'],
    'Age': [28,34,29,42],
    'City':['New York', 'Paris' , 'Berlin' , 'London'],
    "Salary":[65000,70000,62000,85000]
}
#Combining muntiple series is known as dataframe.
#use this data to create dataframe
df = pd.DataFrame(data)
df

    Name  Age      City  Salary
0   john   28  New York   65000
1   anna   34     Paris   70000
2  peter   29    Berlin   62000
3  linda   42    London   85000

In [13]:
#Using list
data_list = [
    ['john' , 28 , 'New York' , 65000],
    ['Anna' , 34 , 'Paris' , 70000],
    ['Peter' , 29 , 'Berlin' , 62000],
    ['Linda' , 42 , 'London' , 85000],
]
columns = ["Name","Age","City","Salary"]

df2 = pd.DataFrame(data_list , columns = columns)

df2

    Name  Age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

**SELECTION AND INDEXING OF COLUMNS**

In [14]:
df2

    Name  Age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [17]:
#select name:
df2["Name"]

0     john
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [18]:
#Targeting muntiple columns:
#Make list of list and target Ex:-
df2[["Name","City"]]

    Name      City
0   john  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

**CREATING A NEW COLUMN**

In [28]:
#lets create a new column in df2 as Designation:
df2["Designation"] = ["Doctor","Engenieer","Professor","Data Scientist"]
df2

    Name  Age      City  Salary     Designation
0   john   28  New York   65000          Doctor
1   Anna   34     Paris   70000       Engenieer
2  Peter   29    Berlin   62000       Professor
3  Linda   42    London   85000  Data Scientist

In [29]:
df2

    Name  Age      City  Salary     Designation
0   john   28  New York   65000          Doctor
1   Anna   34     Paris   70000       Engenieer
2  Peter   29    Berlin   62000       Professor
3  Linda   42    London   85000  Data Scientist

**REMOVING A COLUMN**

In [30]:
#lets Remove designation:
# df2.drop("Designation", axis = 1) 
df2.drop("Designation", axis = 1,inplace = True) 

# drop don't remove designation from main data it only remove designation and show a copy
#To completly remove Designation from data use 'inplace = True'

In [31]:
df2 #in main database designation  is present, after using inplace it will not present anymore

    Name  Age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [32]:
#to remove row make axis = 0

**SELECTING ROWS**

In [33]:
df2

    Name  Age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [34]:
df2.loc[0]

Name          john
Age             28
City      New York
Salary       65000
Name: 0, dtype: object

**SELECTING SUBSETS OF ROWS AND COLUMNS**

In [38]:
df2

    Name  Age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [39]:
df.loc[[0,1]][['City','Salary']]

       City  Salary
0  New York   65000
1     Paris   70000

In [40]:
df.loc[[2,3]][['Name','Age']]

    Name  Age
2  peter   29
3  linda   42

**CONDITIONAL SELECTION**

In [42]:
df2

    Name  Age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [43]:
# I only want to  see those peoples whose age is above 30
df2[df2["Age"]>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [45]:
#i only want people whose age is above 30 and their city must be paris 
df2[(df2['Age'] >30) & (df2["City"] == "Paris")]

   Name  Age   City  Salary
1  Anna   34  Paris   70000